seqscan_benchmarking/head.txt
columns 5 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 9.476 ms
initial connection time = 0.876 ms
tps = 105.529425 (without initial connection time)

columns 5 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 17.228 ms
initial connection time = 0.750 ms
tps = 58.045852 (without initial connection time)

columns 5 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 24.382 ms
initial connection time = 0.775 ms
tps = 41.013442 (without initial connection time)

columns 5 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 31.640 ms
initial connection time = 0.786 ms
tps = 31.605982 (without initial connection time)

columns 5 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 39.590 ms
initial connection time = 0.834 ms
tps = 25.258719 (without initial connection time)

columns 5 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 45.400 ms
initial connection time = 0.927 ms
tps = 22.026301 (without initial connection time)

columns 5 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 53.284 ms
initial connection time = 0.998 ms
tps = 18.767349 (without initial connection time)

columns 5 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 61.015 ms
initial connection time = 1.128 ms
tps = 16.389345 (without initial connection time)

columns 5 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 68.911 ms
initial connection time = 0.882 ms
tps = 14.511444 (without initial connection time)

columns 5 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 76.356 ms
initial connection time = 1.368 ms
tps = 13.096517 (without initial connection time)

columns 10 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 9.836 ms
initial connection time = 0.784 ms
tps = 101.668481 (without initial connection time)

columns 10 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 18.934 ms
initial connection time = 0.812 ms
tps = 52.816158 (without initial connection time)

columns 10 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 25.417 ms
initial connection time = 1.000 ms
tps = 39.343917 (without initial connection time)

columns 10 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 32.972 ms
initial connection time = 0.809 ms
tps = 30.328791 (without initial connection time)

columns 10 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 40.279 ms
initial connection time = 0.862 ms
tps = 24.826722 (without initial connection time)

columns 10 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 48.308 ms
initial connection time = 0.840 ms
tps = 20.700531 (without initial connection time)

columns 10 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 51.342 ms
initial connection time = 1.121 ms
tps = 19.477136 (without initial connection time)

columns 10 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 65.383 ms
initial connection time = 1.250 ms
tps = 15.294575 (without initial connection time)

columns 10 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 71.180 ms
initial connection time = 1.445 ms
tps = 14.048874 (without initial connection time)

columns 10 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 79.267 ms
initial connection time = 1.306 ms
tps = 12.615573 (without initial connection time)

columns 15 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 10.252 ms
initial connection time = 0.895 ms
tps = 97.539374 (without initial connection time)

columns 15 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 18.236 ms
initial connection time = 0.886 ms
tps = 54.836256 (without initial connection time)

columns 15 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 28.018 ms
initial connection time = 0.899 ms
tps = 35.691265 (without initial connection time)

columns 15 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 34.585 ms
initial connection time = 0.849 ms
tps = 28.914478 (without initial connection time)

columns 15 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 43.108 ms
initial connection time = 1.093 ms
tps = 23.197669 (without initial connection time)

columns 15 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 50.642 ms
initial connection time = 0.904 ms
tps = 19.746561 (without initial connection time)

columns 15 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 54.855 ms
initial connection time = 1.754 ms
tps = 18.230045 (without initial connection time)

columns 15 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 69.054 ms
initial connection time = 1.085 ms
tps = 14.481504 (without initial connection time)

columns 15 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 76.897 ms
initial connection time = 1.387 ms
tps = 13.004419 (without initial connection time)

columns 15 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 85.931 ms
initial connection time = 1.931 ms
tps = 11.637194 (without initial connection time)

columns 20 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 10.774 ms
initial connection time = 0.899 ms
tps = 92.817417 (without initial connection time)

columns 20 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 20.248 ms
initial connection time = 0.795 ms
tps = 49.386935 (without initial connection time)

columns 20 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 27.624 ms
initial connection time = 1.135 ms
tps = 36.200550 (without initial connection time)

columns 20 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 36.069 ms
initial connection time = 0.982 ms
tps = 27.724746 (without initial connection time)

columns 20 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 45.137 ms
initial connection time = 0.961 ms
tps = 22.154749 (without initial connection time)

columns 20 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 51.857 ms
initial connection time = 1.071 ms
tps = 19.283792 (without initial connection time)

columns 20 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 63.986 ms
initial connection time = 1.447 ms
tps = 15.628319 (without initial connection time)

columns 20 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 71.140 ms
initial connection time = 1.827 ms
tps = 14.056855 (without initial connection time)

columns 20 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 82.056 ms
initial connection time = 2.084 ms
tps = 12.186786 (without initial connection time)

columns 20 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 92.189 ms
initial connection time = 1.991 ms
tps = 10.847261 (without initial connection time)

columns 25 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 12.298 ms
initial connection time = 0.930 ms
tps = 81.315754 (without initial connection time)

columns 25 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 21.434 ms
initial connection time = 0.902 ms
tps = 46.654216 (without initial connection time)

columns 25 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 31.069 ms
initial connection time = 1.168 ms
tps = 32.185968 (without initial connection time)

columns 25 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 40.115 ms
initial connection time = 1.065 ms
tps = 24.928337 (without initial connection time)

columns 25 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 49.494 ms
initial connection time = 1.316 ms
tps = 20.204437 (without initial connection time)

columns 25 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 58.638 ms
initial connection time = 1.606 ms
tps = 17.053727 (without initial connection time)

columns 25 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 69.978 ms
initial connection time = 1.452 ms
tps = 14.290210 (without initial connection time)

columns 25 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 80.494 ms
initial connection time = 1.490 ms
tps = 12.423212 (without initial connection time)

columns 25 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 89.213 ms
initial connection time = 2.814 ms
tps = 11.209154 (without initial connection time)

columns 25 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 94.821 ms
initial connection time = 2.218 ms
tps = 10.546198 (without initial connection time)

columns 30 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 11.988 ms
initial connection time = 1.038 ms
tps = 83.418559 (without initial connection time)

columns 30 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 21.063 ms
initial connection time = 2.873 ms
tps = 47.477632 (without initial connection time)

columns 30 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 30.137 ms
initial connection time = 2.207 ms
tps = 33.182045 (without initial connection time)

columns 30 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 39.296 ms
initial connection time = 0.970 ms
tps = 25.448083 (without initial connection time)

columns 30 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 49.598 ms
initial connection time = 1.316 ms
tps = 20.162205 (without initial connection time)

columns 30 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 58.715 ms
initial connection time = 1.612 ms
tps = 17.031371 (without initial connection time)

columns 30 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 69.523 ms
initial connection time = 2.447 ms
tps = 14.383781 (without initial connection time)

columns 30 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 81.012 ms
initial connection time = 2.395 ms
tps = 12.343867 (without initial connection time)

columns 30 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 95.291 ms
initial connection time = 1.933 ms
tps = 10.494183 (without initial connection time)

columns 30 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 100.712 ms
initial connection time = 13.562 ms
tps = 9.929261 (without initial connection time)